{"Character-Options":{"slug":"Character-Options","filePath":"Character Options.md","title":"Character Options","links":["Guilds-and-Factions-and-Nobility"],"tags":[],"content":"We are using the 2024 D&amp;D Rules. Character creation is to be done in D&amp;D Beyond. Before creating a character, you can join our D&amp;D Beyond Campaign, creating your character in the campaign lets you use additional character options. (click the link to join)\nIf you want to then also create your character in Roll20, feel free to do so. I don’t care where you roll, I expect you to announce it aloud. If you’re cheating, you’re robbing only yourself. Trust me as your DM/GM to take your failed rolls and turn them into enjoyable stories.\nThere are many supplementary books containing countless subclasses, species, backgrounds. Anything from official material is allowed. However, keep in mind that we are playing on D&amp;D Beyond. I have a subscription to D&amp;D Beyond, which will give you access to a couple extra books for free since I own them, and share them with you if you join the D&amp;D Beyond campaign.\n\n\n                  \n                  Available Books \n                  \n                \n\n\nPlayer’s Handbook (2024)\nTasha’s Cauldron of Everything (2014)\nXanathar’s Guide to Everything (2014)\n\nCheck the D&amp;D Beyond Settings section to ensure you have the right options enabled to be able to use all of these options. Tasha’s and Xanathar’s are both considered ‘legacy’ content (very cringe).\n\n\nWhen creating your character, you may want to be part of a guild, faction or noble house as can be found in Section: Guilds and Factions and Nobility. Being part of a guild is common, but being part of a faction or nobility is far rarer, and should have important story implications for your character to justify this membership.\nOur adventure starts in the Yawning Portal. Our party members may be familiar with each other already, you can reach out to other players to ask to create backstories that are somehow related. In the Yawning Portal, an inciting incident will set your adventure afoot and bring your characters together.\nTo motivate your decision to be be present at the Yawning Portal, you may want to choose one of the Friendly Faces at the tavern that your character might be familiar with.\n\n\n                  \n                  Friendly Faces \n                  \n                \n\n\nD&amp;D Beyond Settings\nSources. Listed below are all options that must be enabled:\n\nHomebrew\nCore Rules\nExpanded Rules\n2014 Expanded Rules\nLegacy/Noncore\nMake sure that ‘2014 Core Rules’ are disabled! We are not using the 2014 classes.\n\n\n\n                  \n                  Screenshot of Settings \n                  \n                \n\n\n\n\n\n\n                  \n                  Want a class that I don&#039;t own? \n                  \n                \n\nBuy it yourself :)\nIf multiple people want something from a book I don’t own, then I’ll consider getting it. I’m rich don’t worry about it (don’t insight check that please). I tend to be the DM, so I will most certainly find use from all of these books for years and years to come.\n\n\n\n\n                  \n                  Too many character options? \n                  \n                \n\nYou can disable the 2014 Expanded Rules and Legacy/Noncore if there’s just way too much to choose from. Especially with some relatively new players, don’t feel bad if it’s overwhelming! You can always DM me to ask questions.\n\n\nPartnered Content. Personal choice. You can use any partnered content you like, but run it by me first. Stuff like Blood Hunter and Artificer are obviously fine. But if you find some whacky ass subclass or background, let me know.\nDice Rolling. Should be enabled by default, personal choice. If the dice rolling is laggy on your computer, you may need to enable Hardware Acceleration in your browser. Google it :3 (or ask me) You’re also allowed to roll physically IRL!\nOptional Features. You can enable both if you like, but I’m not actually sure they do anything anymore! The ability to customize your background/origin’s ability scores is now available by default. As for optional class features, I don’t know of any for the 2024 classes. But, feel free to keep them enabled incase they do give you some random lil option somewhere.\nAdvancement Type. Milestone (duh).\nHit Point Type. Manual. This does mean that you will have to roll for HP every level! D&amp;D Beyond will only give you your ‘default’ HP increase, every time we level up you will have to click “Manage HP” under the 1. Class tab of the character creator. There, you can fill in your new rolled total. I will remind you every level up.\nUse Prerequisites. Both enabled.\nShow Level-Scaled Spells. Personal choice, I recommend turning this on.\nEncumbrance Type. Use Encumbrance. Makes it so you can’t carry infinite shit around with you. Shouldn’t really come into play.\nIgnore Coin Weight. Enabled.\nAbility Score/Modifier Display. Personal choice.\nCharacter Privacy. Set to ‘Campaign Only’ or ‘Public’. If set to Private, I can’t see your character sheet. I want to know what you’re working with, so I can figure out fun ways to torture you engage your character’s strength in the story. :)\nUse of AI is forbidden\nWhile I am ideologically opposed to AI, I want to forbid it for this campaign for a different reason: I like things to be scuffed and rough and personal. If you are holding yourself to a standard where every word you write, and your character art and your character token must be completely unique and high-quality and professional, you are holding yourself to too high of a standard.\nFor character art, you can make a crude Microsoft Paint drawing, find character art online, find art of any ol’ character that inspired your character or looks like them, or even use any of the default art inside of D&amp;D Beyond. I do not, by any measure, expect you to commission a full artwork for the campaign. Steal your art like we used to back in the day! (off some random persons Tumblr)\nFor backstory stuff, take the minimal amount of time it takes to write something. It doesn’t have to be a complete novel with full descriptions in the form of a story. Bunch of short bullet points will certainly get the idea across. See below for an example.\n\n\n                  \n                  Example Backstory \n                  \n                \n\nJimmy Ballgrabbler\nGoblin, fighter with high intelligence\ngonna use the magic stone spell to throw magic pebbles at people\nwas born in a goblin camp idk somewhere close to waterdeep i guess\nhis mom told him to stop playing with pebbles and he got so mad that he unlocked a deep well of magical powers\nhes now a runaway from home, trying to get together money so he can join the magic guild of waterdeep or whatever tf it was called so he can learn actual magic beyond just magic stone\nalso has one arm lol so he can only throw stuff with 1 hand\nhas a silly scottish accent and looooves drinking kinda like nott the brave from critical role campaign 2. infact the character art is gonna be nott from critical role\nhere’s my token (one of the top result when i google “nott the brave” on google images)\n\n\n"},"Guilds-and-Factions-and-Nobility":{"slug":"Guilds-and-Factions-and-Nobility","filePath":"Guilds and Factions and Nobility.md","title":"Guilds and Factions and Nobility","links":["Character-Options"],"tags":[],"content":"Let us differentiate between guilds and factions.\nGuilds are legal entities that represent groups of people based on trade. Factions are groups that come together for a common purpose, whether nefarious or noble. Nobility are family houses that are rich and powerful, most often by way of large business ventures, but some also make their money by more sinister means.\nGuilds\nAny characters with the guild artisan background are assumed to have free membership in one Waterdeep guild of their choice. Arcane spellcasters living in the city are required by law to register with the Watchful Order of Magists and Protectors, so that they can be called on to defend the city with their magic in times of need.\n\n\n                  \n                  The Guild Artisan background \n                  \n                \n\nThe actual Guild Artisan background isn’t available on D&amp;D Beyond for free, it’s a part of the 2024 Player’s Handbook. (30$!!!!!) As such, using any other background and having the aspect of the guild be part of your story background is more than enough.\nCheck the section Character Options for more discussion.\n\n\n\nBy law, there are no active thieves’ guilds in Waterdeep.\nTo join a guild, one must possess a background, a proficiency, or a status that the guild values. For example, a character with the sailor background is welcome to join the Master Mariners’ Guild. One can practice a profession and not be a guild member, but such autonomy carries a cost. The guilds do everything they can to entice new members to join and pay for membership, and they go out of their way to hinder independent business owners, up to and including driving them out of business. A baker who refuses to join the Bakers’ Guild might find her flour supply cut off, while a wizard who refuses to join the Watchful Order of Magists and Protectors might be denied access to sages, libraries, and other useful resources.\nWhile normally guild membership costs money, this extra bookkeeping is lame and won’t be important.\n\n\n                  \n                   Guilds of Waterdeep\n                  \n                \n\nBakers’ Guild\nCarpenters’, Roofers’, and Plaisterers’ Guild\nCellarers’ and Plumbers’ Guild\nCoopers’ Guild\nCouncil of Farmer-Grocers\nCouncil of Musicians, Instrument-makers, and Choristers\nDungsweepers’ Guild\nFellowship of Bowyers and Fletchers\nFellowship of Carters and Coachmen\nFellowship of Innkeepers\nFellowship of Salters, Packers, and Joiners\nFishmongers’ Fellowship\nGuild of Apothecaries and Physicians\nGuild of Butchers\nGuild of Chandlers and Lamplighters\nGuild of Fine Carvers\nGuild of Glassblowers, Glaziers, and Spectacle-makers\nGuild of Stonecutters, Masons, Potters, and Tile-makers\nGuild of Trusted Pewterers and Casters\nGuild of Watermen\nJesters’ Guild\nJewelers’ Guild\nLaunderers’ Guild\nLeague of Basket-makers and Wickerworkers\nLeague of Skinners and Tanners\nLoyal Order of Street Laborers\nMaster Mariners’ Guild\nMost Careful Order of Skilled Smiths and Metalforgers\nMost Diligent League of Sail-makers and Cordwainers\nMost Excellent Order of Weavers and Dyers\nOrder of Cobblers and Corvisers\nOrder of Master Shipwrights\nOrder of Master Tailors, Glovers, and Mercers\nSaddlers’ and Harness-makers’ Guild\nScriveners’, Scribes’, and Clerks’ Guild\nSolemn Order of Recognized Furriers and Woolmen\nSplendid Order of Armorers, Locksmiths, and Finesmiths\nStablesmasters’ and Farriers’ Guild\nStationers’ Guild\nSurveyors’, Map-, and Chart-makers’ Guild\nVintners’, Distillers’, and Brewers’ Guild\nWagon-makers’ and Coach Builders’ Guild\nWatchful Order of Magists and Protectors\nWheelwrights’ Guild\nFactions\nThere are many factions participating in the continual power struggle in Waterdeep. Some are criminal in nature and as such very little is known about their functioning. Some are so enigmatic, they may just be myths. As players, some are assumed to be common knowledge, some are not commonly known but can be known depending on your character, and some are entirely unknown.\nListed below are the joinable factions of Waterdeep. If you join these, more information may become known to you. Presented further is introductory information about each faction.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFactionAwarenessHarpersPublicLords’ AlliancePublicOrder of the GauntletPublicEmerald EnclavePublicForce Grey / Gray HandsPublic*Zhentarim (Doom Raiders)Underground’The Drow faction’Secret* The Gray Hands’ and Force Grey’s existence is common knowledge, but their members are entirely unknown to the public.\nHarpers. Any smart, non-evil character can join the Harpers of Waterdeep. Bards and wizards are especially welcome.\nHarpers are altruists who work behind the scenes to keep power out of the hands of evil tyrants. Harper spies might use the adventurers as instruments to get at the truth. Various nobles and guildmasters in the city are Harper sympathizers.\nLords’ Alliance. To become a member of the Lords’ Alliance faction in Waterdeep, a character must be a Waterdavian citizen. Those with criminal records can also join, provided they demonstrate their allegiance to the city.\nThe Lords’ Alliance is a confederation of cities and towns up and down the Sword Coast and throughout the North. Members of the alliance must come to one another’s aid in times of need, and the organization uses field operatives (diplomats, spies, and assassins) to safeguard its interests.\nOrder of the Gauntlet. Any non-evil character can join the Order of the Gauntlet in Waterdeep. Clerics, monks, and paladins are especially welcome, particularly if they worship Helm, Torm, or Tyr.\nThe order’s mission is to seek out and destroy evil before it gains a foothold. The surge of violence in Waterdeep spurs members of the order to find adventurers who can help return peace to the city.\nEmerald Enclave. A character must demonstrate an interest in protecting nature or the natural order to join the Emerald Enclave. Druids and rangers are especially welcome.\nWaterdeep harbors a few members of the faction, which seeks to foster harmony between nature and civilization. Members living in Waterdeep help guard the city against unnatural threats, including aberrations and undead. They also watch over the City of the Dead (Waterdeep’s public cemetery) and the city’s parks.\nForce Grey and the Gray Hands. To join Force Grey, one must first become a member of the Gray Hands. An individual who has served in the City Watch or the City Guard is eligible to join, as are characters who are willing to swear oaths to defend Waterdeep, its citizens, and its laws with their lives.\nForce Grey is an elite cadre of specialized adventurers, drawn from the ranks of the Gray Hands, whose fighting prowess is matched only by their loyalty to the city. Force Grey attracts the best of the best. Characters don’t begin their adventuring careers as members of Force Grey, but they can work up to that status.\nZhentarim. More commonly known as The Black Network, has an open recruitment policy. Anyone can join. Tenacity and loyalty are highly valued (but not essential) traits in new members. The Zhentarim is a shadow organization that trades mercenaries and goods (including weapons) for profit. The Zhentarim in Waterdeep is a fractured organization. Only the Doom Raiders, a branch of The Black Network, are joinable.\n‘The Drow Faction.’ A character is highly preferred to be a drow in order to join this faction. Nothing else is known about this faction, their very existence isn’t certain, there are only rumors of a faction of drow in the city. If you decide to join, more information will be made available.\nNoble Families\nWaterdeep contains well over a hundred noble families. Below are a list of good choices for nobility to join. If you wish to create a homebrew noble house, or join another noble family that you could find listed on wikis online, then we can discuss that too. Any character that has a background in nobility can join one of these houses. The actual Noble background isn’t available on D&amp;D Beyond for free.\n\n\n                  \n                  The Noble background \n                  \n                \n\nJust like the Guild Artisan background, the Noble background is not available for free.\nCheck the section Character Options for more discussion.\n\n\nHouse Amcathra. The Amcathras are a Tethyrian family that specializes in horse breeding and training, cattle ranching, wine-making, and weaponsmithing. The family motto is “We trample our troubles.” The family has a large villa in the North Ward, on the east side of the High Road between Hassantyr’s Street and Tarnath Street.\nHouse Margaster. The Margasters are an Illuskan family whose business interests lie in land-based shipping and bulk goods trading. The house also has a quiet history of wizardry. The family motto is “Nothing is beyond our grasp.” The Margaster family estate is situated between Stabbed Sailor Alley and Shattercrock Alley in the North Ward.\nHouse Phylund. The Phylunds are a Tashlutar family that captures and sells monsters. Monsters that can’t be trained as pets or guard beasts are sold to arenas or harvested for their meat, bones, and skins. The Phylunds sponsor adventuring parties and monster-hunting expeditions, and their motto is “What you fear, we master.” House Phylund has an estate on Copper Street. west of the High Road between Julthoon Street and Trader’s Way in the North Ward.\nHouse Rosznar. Once banished from Waterdeep for smuggling, slavery, and other crimes, this Tethyrian house has returned and is trying to overcome its dark past and disgraceful reputation by focusing on legitimate business ventures such as wine-making and gem trading. The family motto is “We fly high and stoop swift.” Rosznar Villa is situated on Thunderstaff Way between Copper Street and Shield Street in the Sea Ward, west of the High Road."},"Introduction":{"slug":"Introduction","filePath":"Introduction.md","title":"Introduction","links":["images/Map-of-Waterdeep.png","images/EXTRA-LIFE-CHARITY---Volos-Waterdeep-Enchiridion.pdf"],"tags":[],"content":"\nWhat follows is a short story introduction to Waterdeep.\nWaterdeep is a very big and rich city, strewn with wealth and criminality. The city is led by a Council of Waterdeep whose identities are not known, except for one: The Open Lord. Not long ago the previous Open Lord, Lord Dagult Neverember was ousted as Open Lord of Waterdeep after he was found to have embezzled a large amount of gold coins, also known as Dragons in Waterdeep (hence the Dragon Heist). He escaped the city to Neverwinter, which he now rules. The new Open Lord is Lord Laeral Silverhand.\n\n\n                  \n                  Laeral Silverhand \n                  \n                \n\n\nIn recent times there has been increased gang violence across the city, increased taxes to cover for the increased cost of policing that violence, and to recoup the lost gold.\nWhile you, the players, know about this half a million gold, your characters might not, unless they are in some privileged position.\nYou may want to take a look at the map of Waterdeep. (or look at it online, it’s very high resolution!)\nAdditionally, you could take a look at Volo’s Waterdeep Enchiridion. (As a |PDF or in text) It’s an insane amount of lore, 27 pages total. Not necessary in the slightest, and I won’t reference any of it. If you think Waterdeep is cool, there’s a lot of flavour in there, that might also inspire some character ideas. But by no means is it necessary to know to play or follow along."}}